wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_esc.h
/* Define the ESC on chip bus bit position and its register index offset */
#define ESC_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define ESC_REG_VAL(periph)               (REG32(ESC + ((uint32_t)(periph) >> 6U)))
#define ESC_BIT_POS(val)                  ((uint32_t)(val) & 0x1FU)

#define ESC_WRITE_BYTE                     0x80U                                    /*!< ESC write byte command */
#define ESC_READ_BYTE                      0xC0U                                    /*!< ESC read byte command */

#define ESC_MII_MNG_CTL_OFFSET             0x0510U                                  /*!< ESC MII Management Control register offset */
#define ESC_MII_MNG_STAT_OFFSET            0x0511U                                  /*!< ESC MII Management Status register offset */
#define ESC_PHY_ADDR_OFFSET                0x0512U                                  /*!< ESC PHY Address register offset */
#define ESC_PHY_REG_ADDR_OFFSET            0x0513U                                  /*!< ESC PHY Register Address register offset */
#define ESC_PHY_DATA_OFFSET                0x0514U                                  /*!< ESC PHY Data register offset */
#define MIIM_PDI_ACC_STAT_OFFSET           0x0517U                                  /*!< MII Management PDI Access State register offset */
#define READ_PHY_CMD                       0x1U                                     /*!< read phy command */
#define WRITE_PHY_CMD                      0x2U                                     /*!< write phy command */
#define WRITE_PHY_ENABLE                   0x1U                                     /*!< write phy enable */

#define PDI_ACCESS_MII_MANAGEMENT_ENABLE   0x1U                                     /*!< PDI has access to MII management */

/* Register address offsets for PDI access */
#define ESC_RST_PDI_OFFSET                 0x0041U                                  /*!< ESC Reset PDI register offset */
#define PDI_RESET_R                        0x52U                                    /*!< reset command R */
#define PDI_RESET_E                        0x45U                                    /*!< reset command E */
#define PDI_RESET_S                        0x53U                                    /*!< reset command S */

/* Byte/Word access macros */
#define GET_BYTE0(value)           ((uint8_t)(((value) >> ((0U) * 8U)) & 0xFFU))    /*!< get byte 0 (lowest byte) from value */
#define GET_BYTE1(value)           ((uint8_t)(((value) >> ((1U) * 8U)) & 0xFFU))    /*!< get byte 1 from value */
#define GET_BYTE2(value)           ((uint8_t)(((value) >> ((2U) * 8U)) & 0xFFU))    /*!< get byte 2 from value */
#define GET_BYTE3(value)           ((uint8_t)(((value) >> ((3U) * 8U)) & 0xFFU))    /*!< get byte 3 (highest byte) from value */

#define GET_LOW_BYTE(value)        GET_BYTE0(value)                                 /*!< get low byte from value */
#define GET_HIGH_BYTE(value)       GET_BYTE1(value)                                 /*!< get high byte from value */

#define GET_WORD0(value)           ((uint16_t)(((value) >> ((0U) * 16U)) & 0xFFFFU)) /*!< get word 0 (lower word) from value */
#define GET_WORD1(value)           ((uint16_t)(((value) >> ((1U) * 16U)) & 0xFFFFU)) /*!< get word 1 (higher word) from value */

#define SET_BYTE0(value, byte)     (((value) & 0xFFFFFF00U) | ((uint32_t)(byte)))                          /*!< set byte 0 in value */
#define SET_BYTE1(value, byte)     (((value) & 0xFFFF00FFU) | (((uint32_t)(byte)) << 8U))                  /*!< set byte 1 in value */
#define SET_BYTE2(value, byte)     (((value) & 0xFF00FFFFU) | (((uint32_t)(byte)) << 16U))                 /*!< set byte 2 in value */
#define SET_BYTE3(value, byte)     (((value) & 0x00FFFFFFU) | (((uint32_t)(byte)) << 24U))                 /*!< set byte 3 in value */

#define MAKE_UINT32_FROM_BYTES(b0, b1, b2, b3)  (((uint32_t)(b3) << 24U) | ((uint32_t)(b2) << 16U) | ((uint32_t)(b1) << 8U) | (uint32_t)(b0)) /*!< create uint32 from 4 bytes */
#define MAKE_UINT32_FROM_WORDS(w0, w1)          (((uint32_t)(w1) << 16U) | (uint32_t)(w0))                                                    /*!< create uint32 from 2 words */

/* ESC on chip bus interrupt enable or disable*/
typedef enum {
    ESC_I2CIE             = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 20U),                /*!< Internal I2C overrun interrupt */
    ESC_CCTLIVIE          = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 22U),                /*!< CCTL size & addr illegal value interrupt */
    ESC_WEIE              = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 24U),                /*!< write error interrupt */
    ESC_TOIE              = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 26U),                /*!< time out interrupt */
    ESC_WDLIE             = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 28U),                /*!< write data lost interrupt */
} esc_on_chip_bus_interrupt_enum;

/* ESC on chip bus flags */
typedef enum {
    ESC_FLAG_I2CF          = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 21U),                /*!< Internal I2C communication error flag */
    ESC_FLAG_CCTLIVF       = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 23U),                /*!< CCTL size & addr illegal value flag */
    ESC_FLAG_WEF           = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 25U),                /*!< write error flag */
    ESC_FLAG_TOF           = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 27U),                /*!< time out flag */
    ESC_FLAG_WDLF          = ESC_REGIDX_BIT(ESC_CTL_REG_OFFSET, 29U),                /*!< write data lost flag */
} esc_on_chip_bus_flag_enum;

/* data conversion structure */
typedef struct {
    uint32_t val;
} uint32_val;

/* esc pdi direct read esc core register */
void pdi_direct_read_reg(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi indirect read esc core register */
void pdi_indirect_read_reg(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct write esc core register */
void pdi_direct_write_reg(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi indirect write esc core register */
void pdi_indirect_write_reg(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct read esc pdram */
void pdi_direct_read_pdram(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi indirect read esc pdram */
void pdi_indirect_read_pdram(uint8_t readbuffer[], uint16_t addr, uint16_t count);
/* esc pdi direct write esc pdram */
void pdi_direct_write_pdram(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi indirect write esc pdram */
void pdi_indirect_write_pdram(uint8_t writebuffer[], uint16_t addr, uint16_t count);
/* esc pdi reset */
void pdi_reset(void);
/* esc pdi read phy register */
uint16_t pdi_phy_read(uint8_t phy_addr, uint8_t phy_reg_addr);
/* esc pdi write phy register */
void pdi_phy_write(uint8_t phy_addr, uint8_t phy_reg_addr, uint16_t phy_data);
/* esc brp enable */
void esc_brp_enable(void);
/* esc brp disable */
void esc_brp_disable(void);
/* esc time out enable */
void esc_timeout_enable(void);
/* esc time out disable */
void esc_timeout_disable(void);
/* esc time out counter */
void esc_timeout_cnt(uint32_t cnt);
/* esc enable the on_chip_bus interrupt */
void esc_interrupt_enable(esc_on_chip_bus_interrupt_enum interrupt);
/* esc disable the on_chip_bus interrupt */
void esc_interrupt_disable(esc_on_chip_bus_interrupt_enum interrupt);
/* esc get esc on_chip_bus flags */
FlagStatus esc_interrupt_flag_get(esc_on_chip_bus_flag_enum int_flag);
/* esc clear esc on_chip_bus flags */
void esc_interrupt_flag_clear(esc_on_chip_bus_flag_enum int_flag);

#endif /* GD32H77X_ESC_H */
